** Project Setings
#+BEGIN_SRC elisp
(elpy-set-project-root "D:/Development/version-control/GitHub/Tutorial-Mod/Roguelike_tutorial/SRC/")
#+END_SRC
#+BEGIN_SRC eshell
which virtualenv
#+END_SRC

#+RESULTS:

#+BEGIN_SRC eshell results: output
ls
cd ../SRC/
ls
#+END_SRC

#+RESULTS:
: #engine.py#  arial10x10.png  death_functions.py  entity.py         game_messages.py  input_handlers.py  loader_functions  menu_background1.png  render_functions.py  save
: __pycache__  components      engine.py           fov_functions.py  game_states.py    item_functions.py  map_objects       menus.py              sandbox.py           

 +BEGIN_SRC eshell results: output
#+BEGIN_SRC eshell results: values
which virtualenv
#+END_SRC

#+RESULTS:
*** lisp code to activate py
   #+BEGIN_SRC elisp
(setq org-confirm-babel-evaluate nil)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
(message "Pyton in org turned on")
   #+END_SRC

   #+RESULTS:
   : Pyton in org turned on

**** my
#+BEGIN_SRC python
print ("hi")

#+END_SRC

#+RESULTS:
: None


#+begin_src python :results output
print ("Hello, world!")
#+end_src

#+RESULTS:
: Hello, world!

**** Extracting data from an org-mode table
#+tblname: data_table
| a | 1 |
| b | 2 |
| c | 3 |
#+begin_src python :var val=1 :var data=data_table
# Return row specified by val.
# In non-session mode, use return to return results.
return(data[val])
#+end_src

#+RESULTS:
| b | 2 |


***** passing utf-8 strings to python with workaround
A workaround is to use :preamble with the value # -*- coding:utf-8 -*-

#+NAME: ok-in-passing-var
#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :var data=unicode_str
return data
#+END_SRC

#+RESULTS: ok-in-passing-var
: this string is not ascii!



*** lisp code to activate cmd
   #+BEGIN_SRC elisp
(require 'ob-shell)
(setq org-confirm-babel-evaluate nil)
(org-babel-do-load-languages 'org-babel-load-languages '((shell . t)))

(message "shell in org turned on")
   #+END_SRC
   #+RESULTS:
   : shell in org turned on
**** my
#+BEGIN_SRC shell :results output
rem sadfasdf 

#+END_SRC

#+RESULTS:
: Microsoft Windows [Version 6.1.7601]
: (c) Êîðïîðàöèÿ Ìàéêðîñîôò (Microsoft Corp.), 2009. Âñå ïðàâà çàùèùåíû.
: 
: d:\Development\version-control\GitHub\Tutorial-Mod\Roguelike_tutorial\Doc>Ïðîäîëæèòü? 

#+begin_src python :results output
print ("Hello, world!")
#+end_src
#+RESULTS:
: Hello, world!
**** cmdproxy
   #+BEGIN_SRC elisp
(require 'ob-shell)
(defadvice org-babel-sh-evaluate (around set-shell activate)
  "Add header argument :shcmd that determines the shell to be called."
  (let* ((org-babel-sh-command (or (cdr (assoc :shcmd params)) org-babel-sh-command)))
  ad-do-it
    ))
   #+END_SRC

   #+RESULTS:
   : org-babel-sh-evaluate

#+BEGIN_SRC shell :shcmd "cmdproxy.exe" :results output
dir>>log.txt
#+END_SRC

#+RESULTS:
: Microsoft Windows [Version 6.1.7601]
: (c) Êîðïîðàöèÿ Ìàéêðîñîôò (Microsoft Corp.), 2009. Âñå ïðàâà çàùèùåíû.
: 
: d:\Development\version-control\GitHub\Tutorial-Mod\Roguelike_tutorial\Doc>Ïðîäîëæèòü? 

**** sh
#+BEGIN_SRC shell :results output 
ls 

#+END_SRC

#+RESULTS:
: Microsoft Windows [Version 6.1.7601]
: (c) Êîðïîðàöèÿ Ìàéêðîñîôò (Microsoft Corp.), 2009. Âñå ïðàâà çàùèùåíû.
: 
: d:\Development\version-control\GitHub\Tutorial-Mod\Roguelike_tutorial\Doc>Ïðîäîëæèòü? 


#+BEGIN_SRC eshell :results output 
ls 

#+END_SRC
**** eshell
#+BEGIN_SRC eshell :results output 
ls 

#+END_SRC

#+RESULTS:
: Microsoft Windows [Version 6.1.7601]
: (c) Êîðïîðàöèÿ Ìàéêðîñîôò (Microsoft Corp.), 2009. Âñå ïðàâà çàùèùåíû.
: 
: d:\Development\version-control\GitHub\Tutorial-Mod\Roguelike_tutorial\Doc>Ïðîäîëæèòü? 


#+BEGIN_SRC eshell :results output 
ls 

#+END_SRC
*** lisp code to activate cmd
   #+BEGIN_SRC elisp
	 (require 'ob-eshell)
	 (org-babel-do-load-languages 'org-babel-load-languages '((eshell . t)))

	 (message "shell in org turned on")
   #+END_SRC
   #+RESULTS:
   : shell in org turned on
*** without ob-eshell
   #+BEGIN_SRC elisp
(defun org-babel-execute:eshell (body _params)
  (with-temp-buffer
    (eshell-command body t)
    (buffer-string)))

	 (message "shell in org turned on")
   #+END_SRC

   #+RESULTS:
   : shell in org turned on

   #+BEGIN_SRC eshell
echo $emacs-version
#+END_SRC

#+RESULTS:
: 26.2

**** my
#+BEGIN_SRC eshell :results output 
ls
#+END_SRC
#+RESULTS:
: #nots.org#  ecran.txt  nots.org  nots.org~
#+BEGIN_SRC eshell  :results output
echo ls 
#+END_SRC
#+RESULTS:
: ls
***** standart 
#+begin_src eshell
(setq hello-world "hello, world")
echo $hello-world
#+end_src
#+RESULTS:
: hello, world
***** Support variables assignment
#+begin_src eshell :var name="stardiviner"
echo "hello, " $name
#+end_src
#+RESULTS:
: ("hello, " "stardiviner")
***** Support session
#+begin_src eshell :session *kk*
(setq hello-world "hello, world")
(setq hello-stardiviner "hello, stardiviner")
echo $hello-stardiviner 
#+end_src
#+RESULTS:
: hello, stardiviner

#+begin_src eshell :session *kk*
echo $hello-world
#+end_src
#+RESULTS:
: hello, world

